hydrocarbonVerification/0/thermo:Cv
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thermo:Cv;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 -1 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
2595.32
2595.35
2595.39
2595.42
2595.45
2595.48
2595.51
2595.55
...
)
;

boundaryField
{
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40002
(
2853.78
2595.32
2595.32
2595.35
2595.39
2595.42
2595.45
2595.48
...
)
;
    }
}


// ************************************************************************* //
